{
  "education": [
    {
      "awards_achievements": [
        "Masters Scholarship Award",
        "Double Graduate Teaching Assistantship"
      ],
      "degree": "Master of Computer Science",
      "department": "Faculty of Graduate Studies and Research",
      "duration": "2017-2021",
      "school_name": "University of Regina"
    },
    {
      "awards_achievements": [
        "Cum Laude Honors Graduation Award",
        "Vice Rector's List 2015, 2016"
      ],
      "degree": "Bachelors of Science (Honors)",
      "department": "Computer Science",
      "duration": "2012-2016",
      "school_name": "Forman Christian College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_FatimaAnwer",
  "highlighted_projects": [
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "FireInform: Forest Fire Occurrence Prediction using Multivariate Time Series Classification."
    },
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": null,
      "name": "Machine Learning"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux clustering monitoring agent to monitor, collect and analyze data from host machines in a ten node cluster over a network in a PostgreSQL database provisioned using docker container using bash scripts and crontab to automate the script's execution. Created the SQL queries for analyzing the collected data for better business decisions and resources planning.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Fatima Anwer",
  "others": [
    {
      "bullets": [
        "Udacity Machine Learning (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming",
        "Volunteer, ABC Food bank: Ut enim ad minim veniam"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Data Mining Lab, University of Regina",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2017-2020",
      "title": "Graduate Researcher"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Docker",
      "Maven",
      "PostgreSQL",
      "REST API",
      "MVC Design Pattern",
      "ArcGIS",
      "Time Series Analysis",
      "Machine Learning"
    ],
    "familiar": [
      "Spring and Springboot",
      "Swift/iOS Programming",
      "Data Visualization (R and Python libraries)",
      "Google Cloud Platform",
      "Computer Networks"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub",
      "R",
      "Data Science",
      "Algorithms and Data Structures"
    ]
  },
  "summary": "To put myself in a few words, I am detail-oriented, and an organized problem solver who loves to build solutions for challenging real-world problems. I completed my master's degree in Computer Science from University of Regina with a focus on data mining in March 2021. As part of my graduate studies, I worked on an end-to-end data science application that predicts the occurrences of forest fires at hourly intervals using weather, historical fires, and geospatial data. Subsequently, I published my Thesis titled *FireInform - An Approach to Predict Hourly Forest Fire Occurrences using Multivariate Time Series Classification.* My experience has equipped me with an understanding of business requirements gathering, designing technical solutions, project management, implementing software, and communicating data driven insights to the management. The project was a joint venture with the Social Innovation Hub, ISM Canada. Another interesting role I assumed was mentoring undergraduate researchers at the Data Mining Research Lab. At Jarvis as a Data and Applications Engineer, I learned a bunch of new technologies and skills like software design patterns, core Java programming, version control, building microservices, testing, and deployment. Collaborating within and across teams to address challenges at organizational or personal level helps me foster a productive work environment overall. One of my greatest drives to work in the software industry is the positive impact technology can have at a large scale for the social good. My passion lies in leveraging the power of Data and cutting-edge technology to improve peoples lives on a day-to-day basis."
}
